tutorials/halfSphere/FiniteRateMach5/0/Y_O2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.22;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value		        uniform 0.22;
    }

    outlet
    {
        type            fixedValue;
        value		        uniform 0.22;
    }

    bottom
    {
        type             empty;
    }
    
    obstacle
    {
        type            zeroGradient;
    }


    wedgefront
    {
        type            wedge;
    }
    
    wedgeback
    {
        type            wedge;
    }
}


// ************************************************************************* //
